function calc(a,b){
    return a+ b
}

function print(name){ // тази функция не се експортва остава вътрешна за модула
    console.log(name);
}
module.exports = calc  // това го прави видимо и може да бъде използване в друг файл

// ! може да се експортне всичко -->> обект например не само функции

module.exports = {
    name: 'Pesho',
    calculator: calc,
}

// !! САМО ПО ЕДИН ЕКСПОРТ ЗА ДОКУМЕНТ !! 
// АКО ИСКАМЕ ПОВЕЧЕ ПРОМЕНЛИВИ ТРЯБВА ДА СА В ОБЕКТ ИЛИ МАСИВ И ДА СЕ ЕКСПОРТНЕ ТОЙ